import { skillType } from "@/types/types";

export const familiarList: skillType[] = [
  {
    skill: "JavaScript",
    content:
      "기본 문법 및 동기, 비동기에 대해 이해하며 효율적인 코드를 작성하고자 노력합니다.",
    ability: "🟩🟩🟩⬜⬜",
  },
  {
    skill: "TypeScript",
    content: "적절한 타입 명시를 통해 에러를 최소화할 수 있습니다.",
    ability: "🟩🟩🟩⬜⬜",
  },
  {
    skill: "React",
    content:
      "컴포넌트를 재사용, 재활용하며 Redux, Recoil을 활용한 상태관리 경험이 있습니다.",
    ability: "🟩🟩🟩⬜⬜",
  },
  {
    skill: "Styled-Components",
    content: "props를 적절히 전달해 다방면에 재사용이 가능합니다.",
    ability: "🟩🟩⬜⬜⬜",
  },
];

export const triedList: skillType[] = [
  {
    skill: "Next.js",
    content:
      "Next.js 13 사용 경험이 있습니다. SSR과 CSR 컴포넌트를 적절히 배치합니다.",
    ability: "🟨🟨⬜⬜⬜",
  },
  {
    skill: "Vue",
    content: "Vue3와 Vuex를 활용한 토이 프로젝트 경험이 있습니다.",
    ability: "🟨⬜⬜⬜⬜",
  },
  {
    skill: "Tailwind CSS",
    content: "Next.js와 함께 반응형 웹 디자인을 위해 적용한 경험이 있습니다.",
    ability: "🟨🟨🟨⬜⬜",
  },
  {
    skill: "Java",
    content:
      "객체지향 프로그래밍에 대한 학습 및 Spring boot 사용 경험이 있습니다.",
    ability: "🟨🟨🟨⬜⬜",
  },
  {
    skill: "Flutter",
    content:
      "Riverpod을 활용해 상태관리를 진행하며 모바일 어플리케이션을 개발한 경험이 있습니다.",
    ability: "🟨🟨⬜⬜⬜",
  },
];
